require('dotenv').config();
const mongoose = require('mongoose');
const ChecklistConfig = require('./models/ChecklistConfig');

const serviceData = {
  version: "1.0",
  categories: [
    {
      title: "Α. ΛΑΔΙΑ - ΝΕΡΑ - ΒΑΛΒΟΛΙΝΗ",
      order: 1,
      availableActions: ["ΑΛΛΑΓΗ", "ΕΛΕΓΧΟΣ", "ΣΥΜΠΛΗΡΩΜΑ"],
      items: [
        "ΛΑΔΙ ΜΗΧΑΝΗΣ", "ΒΑΛΒΟΛΙΝΗ ΣΑΣΜΑΝ/ΔΙΑΦΟΡΙΚΟΥ", "ΥΓΡΑ ΦΡΕΝΩΝ",
        "ΥΓΡΑ ΨΥΓΕΙΟΥ", "ΥΓΡΑ ΤΙΜΟΝΙΟΥ", "ΦΡΕΟΝ"
      ]
    },
    {
      title: "Β. ΦΙΛΤΡΑ",
      order: 2,
      availableActions: ["ΑΛΛΑΓΗ", "ΕΛΕΓΧΟΣ"],
      items: [
        "ΦΙΛΤΡΟ ΛΑΔΙΟΥ", "ΦΙΛΤΡΟ ΑΕΡΟΣ", "ΦΙΛΤΡΟ ΚΑΜΠΙΝΑΣ", "ΦΙΛΤΡΟ ΒΕΝΖΙΝΗΣ/ΠΕΤΡΕΛΑΙΟΥ"
      ]
    },
    {
      title: "Γ. ΜΕΡΗ ΚΙΝΗΤΗΡΑ",
      order: 3,
      availableActions: ["ΑΛΛΑΓΗ", "ΕΛΕΓΧΟΣ", "ΕΠΙΔΙΟΡΘΩΣΗ"],
      items: [
        "ΙΜΑΝΤΑΣ ΧΡΟΝΙΣΜΟΥ", "ΚΑΔΕΝΑ", "ΙΜΑΝΤΑΣ ΔΥΝΑΜΟ", "ΙΜΑΝΤΑΣ A/C",
        "ΑΝΤΛΙΑ ΒΕΝΖΙΝΗΣ/ΠΕΤΡΕΛΑΙΟΥ", "ΜΠΕΚ ΒΕΝΖΙΝΗΣ/ΠΕΤΡΕΛΑΙΟΥ", "ΜΠΟΥΖΙ-ΠΡΟΘΕΡΜΑΝΤΗΡΕΣ",
        "ΒΑΛΒΙΔΕΣ", "ΕΚΚΕΝΤΡΑ", "ΦΛΑΝΤΖΑ ΨΕΥΤΟΚΑΠΑΚΟΥ", "ΦΛΑΝΤΖΑ ΚΕΦΑΛΗΣ",
        "ΦΛΑΝΤΖΑ ΚΑΡΤΕΡ", "ΓΕΝΙΚΕΣ ΣΥΣΦΙΞΕΙΣ-ΔΙΑΡΡΟΕΣ", "ΡΥΘΜΙΣΗ ΚΑΡΜΠΙΡΑΤΕΡ-INJECTION",
        "ΕΞΑΤΜΙΣΗ", "ΚΙΝΗΤΗΡΑΣ"
      ]
    },
    {
      title: "Δ. ΦΡΕΝΑ",
      order: 4,
      availableActions: ["ΑΛΛΑΓΗ", "ΕΛΕΓΧΟΣ", "ΕΠΙΔΙΟΡΘΩΣΗ"],
      items: [
        "ΤΑΚΑΚΙΑ", "ΔΙΣΚΟΠΛΑΚΕΣ", "ΣΙΑΓΟΝΕΣ", "ΚΥΛΙΝΔΡΑΚΙΑ", "ΔΑΓΚΑΝΕΣ",
        "ΤΑΜΠΟΥΡΑ", "ΜΑΡΚΟΥΤΣΙΑ", "ΧΕΙΡΟΦΡΕΝΟ"
      ]
    },
    {
      title: "Ε. ΣΥΣΤΗΜΑ ΜΕΤΑΔΟΣΗΣ",
      order: 5,
      availableActions: ["ΑΛΛΑΓΗ", "ΕΛΕΓΧΟΣ", "ΕΠΙΔΙΟΡΘΩΣΗ"],
      items: [
        "ΣΥΜΠΛΕΚΤΗΣ", "ΣΕΤ ΔΙΣΚΟ-ΠΛΑΤΟ", "ΡΟΥΛΕΜΑΝ ΣΥΜΠΛΕΚΤΗ", "ΚΡΕΜΑΡΙΕΡΑ",
        "ΑΜΟΡΤΙΣΕΡ", "ΗΜΙΑΞΟΝΙΟ", "ΦΟΥΣΚΑ ΗΜΙΑΞΟΝΙΟΥ", "ΜΠΙΛΙΟΦΟΡΟΣ ΕΣΩΤΕΡΙΚΟΣ",
        "ΜΠΙΛΙΟΦΟΡΟΣ ΕΞΩΤΕΡΙΚΟΣ", "ΑΚΡΟΜΠΑΡΑ", "ΜΠΑΛΑΚΙΑ", "ΡΟΥΛΕΜΑΝ ΤΡΟΧΟΥ",
        "ΣΥΣΤΗΜΑ ΜΕΤΑΔΟΣΗΣ"
      ]
    },
    {
      title: "Ζ. ΛΟΙΠΕΣ ΕΡΓΑΣΙΕΣ",
      order: 6,
      availableActions: [],
      items: ["Γενικός Έλεγχος & Σχόλια"]
    }
  ]
};

const seedDB = async () => {
    try {
        await mongoose.connect(process.env.MONGO_URI);
        console.log("✅ Η βάση συνδέθηκε...");

        // Διαγραφή παλιών και εισαγωγή νέων
        await ChecklistConfig.deleteMany({});
        await ChecklistConfig.create(serviceData);
        
        console.log("🌱 Η Λίστα Εργασιών αποθηκεύτηκε επιτυχώς!");
        process.exit();
    } catch (err) {
        console.error(err);
        process.exit(1);
    }
};

seedDB();